import matplotlib
matplotlib.use('Agg')  # これにより、非GUIバックエンドを使用
import cv2
import itertools
import numpy as np
import csv
from collections import Counter
from sklearn.cluster import KMeans
import os
import matplotlib.pyplot as plt
import uuid

UPLOAD_FOLDER = "./web/uploads"  # ここでアップロードフォルダを指定

def get_color():
    with open("C:\\Users\\User\\Documents\\GitHub\\emotabi\\web\\color_gloup_new.csv", encoding="utf-8_sig") as f:
        reader = csv.reader(f)
        color_list = [row for row in reader]
        return color_list

def Euclid(colors):
    color_list = get_color()
    kanjo = []
    for l in range(5):
        r = colors[l][0]
        g = colors[l][1]
        b = colors[l][2]
        A = []
        B = []
        C = []
        D_list = []
        for i in range(len(color_list)):
            Dis1 = float(color_list[i][0])
            Dis2 = float(color_list[i][1])
            Dis3 = float(color_list[i][2])
            A.append(Dis1)
            B.append(Dis2)
            C.append(Dis3)
        for k in range(len(color_list)):
            D = ((A[k] - r) ** 2 + (B[k] - g) ** 2 + (C[k] - b) ** 2) ** 0.5
            D_list.append(D)
        Min_index = D_list.index(min(D_list))
        kanjo_map = {
            0: ["明るい","陽気な","深い","重い","にごった","派手な","きれいな","かたい","荒々しい","くどい","強い","活発な","暖かい","嫌いな","落ち着く","かわいい"],
            1: ["暗い","陰気な","深い","重い","にごった","地味な","きたない","かたい","荒々しい","くどい","強い","活発な","暖かい","嫌いな","落ち着く","かわいい"],
            2: ["明るい","陽気な","浅い","軽い","澄んだ","派手な","きれいな","やわらかい","荒々しい","あっさりした","弱い","活発な","暖かい","好きな","楽しい","かわいい"],
            3: ["明るい","陽気な","浅い","軽い","澄んだ","派手な","きれいな","やわらかい","荒々しい","あっさりした","弱い","活発な","暖かい","好きな","楽しい","かわいい"],
            4: ["暗い","陰気な","浅い","軽い","にごった","地味な","きたない","やわらかい","冷静な","あっさりした","弱い","落ち着く","冷たい","嫌いな","落ち着く","かわいい"],
            5: ["明るい","陽気な","浅い","軽い","澄んだ","派手な","きれいな","やわらかい","荒々しい","くどい","強い","活発な","暖かい","好きな","楽しい","かわいい"],
            6: ["明るい","陽気な","深い","重い","にごった","派手な","きたない","やわらかい","荒々しい","くどい","強い","活発な","暖かい","嫌いな","落ち着く","かわいい"],
            7: ["暗い","陰気な","深い","重い","にごった","地味な","きたない","かたい","荒々しい","くどい","強い","静かな","暖かい","嫌いな","落ち着く","かっこいい"],
            8: ["明るい","陽気な","浅い","軽い","澄んだ","派手な","きれいな","やわらかい","荒々しい","くどい","強い","活発な","暖かい","好きな","楽しい","かわいい"],
            9: ["明るい","陽気な","深い","重い","にごった","派手な","きたない","やわらかい","荒々しい","くどい","強い","活発な","暖かい","嫌いな","落ち着く","かわいい"],

            10: ["明るい","陽気な","浅い","軽い","澄んだ","派手な","きれいな","やわらかい","荒々しい","あっさりした","弱い","活発な","暖かい","好きな","楽しい","かわいい"],
            11: ["明るい","陽気な","浅い","軽い","澄んだ","派手な","きれいな","かたい","荒々しい","くどい","強い","活発な","暖かい","嫌いな","楽しい","かわいい"],
            12: ["明るい","陰気な","浅い","軽い","にごった","地味な","きたない","やわらかい","冷静な","あっさりした","弱い","静かな","暖かい","嫌いな","落ち着く","かわいい"],
            13: ["暗い","陰気な","深い","重い","にごった","地味な","きたない","かたい","荒々しい","くどい","強い","静かな","暖かい","嫌いな","落ち着く","かっこいい"],
            14: ["暗い","陰気な","深い","重い","にごった","地味な","きたない","かたい","冷静な","くどい","強い","静かな","暖かい","嫌いな","落ち着く","かっこいい"],
            15: ["暗い","陰気な","深い","重い","にごった","地味な","きたない","かたい","荒々しい","くどい","強い","静かな","暖かい","嫌いな","落ち着く","かっこいい"],
            16: ["暗い","陰気な","深い","重い","にごった","地味な","きたない","かたい","冷静な","くどい","強い","静かな","暖かい","嫌いな","落ち着く","かっこいい"],
            17: ["明るい","陽気な","浅い","軽い","にごった","地味な","きたない","やわらかい","荒々しい","くどい","強い","活発な","暖かい","嫌いな","落ち着く","かっこいい"],
            18: ["明るい","陰気な","浅い","軽い","澄んだ","地味な","きれいな","やわらかい","冷静な","あっさりした","弱い","静かな","冷たい","嫌いな","落ち着く","かわいい"],
            19: ["明るい","陽気な","浅い","軽い","澄んだ","派手な","きれいな","やわらかい","冷静な","あっさりした","弱い","活発な","暖かい","好きな","楽しい","かわいい"],

            20: ["明るい","陽気な","浅い","軽い","澄んだ","派手な","きれいな","かたい","荒々しい","くどい","強い","活発な","暖かい","好きな","楽しい","かわいい"],
            21: ["明るい","陽気な","浅い","軽い","澄んだ","派手な","きれいな","やわらかい","荒々しい","あっさりした","強い","活発な","暖かい","好きな","楽しい","かわいい"],
            22: ["明るい","陽気な","浅い","軽い","澄んだ","派手な","きれいな","やわらかい","荒々しい","くどい","強い","活発な","暖かい","好きな","楽しい","かわいい"],
            23: ["明るい","陰気な","浅い","軽い","にごった","地味な","きたない","やわらかい","冷静な","あっさりした","弱い","静かな","暖かい","嫌いな","落ち着く","かわいい"],
            24: ["明るい","陰気な","浅い","軽い","にごった","地味な","きたない","やわらかい","冷静な","あっさりした","弱い","静かな","冷たい","嫌いな","落ち着く","かわいい"],
            25: ["暗い","陰気な","深い","重い","にごった","地味な","きたない","かたい","冷静な","くどい","強い","静かな","冷たい","嫌いな","落ち着く","かっこいい"],
            26: ["暗い","陰気な","深い","重い","にごった","地味な","きたない","かたい","冷静な","くどい","強い","静かな","冷たい","嫌いな","落ち着く","かっこいい"],
            27: ["明るい","陽気な","浅い","軽い","澄んだ","派手な","きれいな","やわらかい","冷静な","あっさりした","弱い","活発な","暖かい","好きな","楽しい","かわいい"],
            28: ["明るい","陽気な","浅い","軽い","澄んだ","派手な","きれいな","やわらかい","荒々しい","あっさりした","強い","活発な","暖かい","好きな","楽しい","かわいい"],
            29: ["暗い","陰気な","深い","軽い","にごった","地味な","きたない","やわらかい","冷静な","くどい","強い","静かな","冷たい","嫌いな","落ち着く","かっこいい"],

            30: ["明るい","陰気な","浅い","軽い","にごった","地味な","きたない","やわらかい","冷静な","あっさりした","弱い","静かな","冷たい","嫌いな","落ち着く","かわいい"],
            31: ["明るい","陽気な","浅い","軽い","澄んだ","派手な","きれいな","やわらかい","冷静な","あっさりした","弱い","静かな","冷たい","好きな","落ち着く","かわいい"],
            32: ["明るい","陽気な","浅い","軽い","澄んだ","派手な","きれいな","やわらかい","荒々しい","あっさりした","強い","活発な","暖かい","好きな","楽しい","かわいい"],
            33: ["暗い","陰気な","深い","重い","にごった","地味な","きれいな","かたい","冷静な","くどい","強い","静かな","冷たい","好きな","落ち着く","かっこいい"],
            34: ["暗い","陰気な","深い","軽い","にごった","地味な","きたない","かたい","冷静な","くどい","弱い","静かな","冷たい","嫌いな","落ち着く","かっこいい"],
            35: ["暗い","陰気な","深い","重い","にごった","地味な","きたない","かたい","冷静な","くどい","弱い","静かな","冷たい","嫌いな","落ち着く","かっこいい"],
            36: ["明るい","陽気な","浅い","軽い","澄んだ","派手な","きれいな","やわらかい","冷静な","あっさりした","弱い","静かな","冷たい","好きな","楽しい","かわいい"],
            37: ["明るい","陽気な","深い","重い","澄んだ","派手な","きれいな","かたい","冷静な","くどい","強い","静かな","冷たい","好きな","落ち着く","かっこいい"],
            38: ["明るい","陽気な","浅い","軽い","澄んだ","地味な","きれいな","やわらかい","冷静な","あっさりした","弱い","静かな","冷たい","好きな","楽しい","かわいい"],
            39: ["明るい","陽気な","浅い","軽い","澄んだ","派手な","きれいな","やわらかい","冷静な","あっさりした","弱い","静かな","冷たい","好きな","楽しい","かわいい"],

            40: ["暗い","陰気な","深い","軽い","にごった","地味な","きたない","やわらかい","冷静な","あっさりした","弱い","静かな","冷たい","嫌いな","落ち着く","かっこいい"],
            41: ["明るい","陽気な","浅い","軽い","澄んだ","派手な","きれいな","かたい","冷静な","あっさりした","強い","活発な","冷たい","好きな","楽しい","かわいい"],
            42: ["暗い","陰気な","深い","重い","澄んだ","地味な","きれいな","かたい","冷静な","くどい","強い","静かな","冷たい","好きな","落ち着く","かっこいい"],
            43: ["明るい","陽気な","浅い","軽い","澄んだ","派手な","きれいな","かたい","冷静な","あっさりした","強い","静かな","冷たい","好きな","楽しい","かっこいい"],
            44: ["明るい","陽気な","深い","重い","澄んだ","派手な","きれいな","かたい","冷静な","くどい","強い","静かな","冷たい","好きな","楽しい","かっこいい"],
            45: ["明るい","陰気な","深い","軽い","にごった","地味な","きれいな","やわらかい","冷静な","あっさりした","弱い","静かな","冷たい","嫌いな","楽しい","かっこいい"],
            46: ["暗い","陰気な","深い","重い","にごった","地味な","きたない","かたい","冷静な","くどい","強い","静かな","冷たい","好きな","落ち着く","かっこいい"],
            47: ["暗い","陰気な","深い","重い","澄んだ","地味な","きれいな","かたい","冷静な","くどい","強い","静かな","冷たい","嫌いな","落ち着く","かっこいい"],
            48: ["明るい","陰気な","深い","重い","澄んだ","派手な","きれいな","かたい","冷静な","くどい","強い","静かな","冷たい","好きな","落ち着く","かっこいい"],
            49: ["暗い","陰気な","深い","重い","にごった","地味な","きれいな","かたい","冷静な","くどい","強い","静かな","冷たい","好きな","落ち着く","かっこいい"],

            50: ["明るい","陽気な","浅い","軽い","澄んだ","派手な","きれいな","やわらかい","冷静な","あっさりした","弱い","静かな","冷たい","好きな","落ち着く","かわいい"],
            51: ["明るい","陽気な","浅い","軽い","澄んだ","派手な","きれいな","やわらかい","冷静な","あっさりした","弱い","静かな","冷たい","好きな","落ち着く","かわいい"],
            52: ["暗い","陰気な","深い","重い","にごった","派手な","きれいな","かたい","冷静な","くどい","強い","静かな","冷たい","嫌いな","落ち着く","かっこいい"],
            53: ["明るい","陽気な","浅い","軽い","澄んだ","派手な","きれいな","やわらかい","荒々しい","あっさりした","弱い","静かな","暖かい","嫌いな","落ち着く","かわいい"],
            54: ["明るい","陽気な","深い","重い","にごった","派手な","きたない","やわらかい","荒々しい","くどい","強い","静かな","暖かい","嫌いな","落ち着く","かわいい"],
            55: ["暗い","陰気な","深い","重い","にごった","地味な","きたない","かたい","冷静な","くどい","強い","静かな","冷たい","嫌いな","落ち着く","かわいい"],
            56: ["暗い","陰気な","深い","重い","にごった","地味な","きたない","かたい","冷静な","くどい","強い","静かな","冷たい","嫌いな","落ち着く","かわいい"],
            57: ["明るい","陽気な","浅い","軽い","澄んだ","地味な","きれいな","やわらかい","冷静な","あっさりした","弱い","静かな","冷たい","好きな","落ち着く","かわいい"],
            58: ["明るい","陽気な","浅い","軽い","澄んだ","地味な","きれいな","やわらかい","冷静な","あっさりした","弱い","静かな","冷たい","好きな","楽しい","かわいい"],
            59: ["明るい","陰気な","浅い","軽い","にごった","地味な","きたない","やわらかい","冷静な","あっさりした","弱い","静かな","冷たい","好きな","落ち着く","かわいい"],

            60: ["暗い","陰気な","浅い","軽い","にごった","地味な","きたない","やわらかい","冷静な","あっさりした","弱い","静かな","冷たい","嫌いな","落ち着く","かっこいい"],
            61: ["暗い","陰気な","深い","重い","にごった","地味な","きたない","やわらかい","冷静な","くどい","弱い","静かな","冷たい","嫌いな","落ち着く","かっこいい"],
            62: ["暗い","陰気な","深い","重い","にごった","地味な","きたない","かたい","冷静な","くどい","弱い","静かな","冷たい","嫌いな","落ち着く","かっこいい"],
            63: ["暗い","陰気な","深い","重い","にごった","地味な","きたない","かたい","冷静な","くどい","強い","静かな","冷たい","嫌いな","落ち着く","かっこいい"],            
        }
        kanjo.append(kanjo_map.get(Min_index, []))
    kanjoS = list(itertools.chain.from_iterable(kanjo))
    kanjo_list = Counter(kanjoS)
    Top3_kanjo = dict(Counter(kanjoS).most_common(3))
    result = list(Top3_kanjo.keys())

    with open("iroshikisai_af_emoi結果_colornew.csv", "w", newline="", encoding="utf-8_sig") as f:
        writer = csv.writer(f)
        writer.writerow(["感情言語", "出現回数"])
        for emotion, count in kanjo_list.items():
            writer.writerow([emotion, count])
    return result

def cluster_percents(labels):
    total = len(labels)
    percents = []
    for i in set(labels):
        percent = (np.count_nonzero(labels == i) / total) * 100
        percents.append(round(percent, 2))
    return percents

def process_image(filepath):
    print(f"Processing image at: {filepath}")  # デバッグ出力
    image = cv2.imread(filepath)
    rgbs = cv2.cvtColor(image, cv2.COLOR_BGR2RGB)
    rgb_list = list(itertools.chain(*rgbs.tolist()))

    clusters = KMeans(n_clusters=5).fit(rgb_list)
    colors = clusters.cluster_centers_
    percents = cluster_percents(clusters.labels_)

    emotions = Euclid(colors)

    colors_normalized = colors / 255
    colors_list = colors_normalized.tolist()
    percents_list = cluster_percents(clusters.labels_)
    tup = zip(colors_list, percents_list)
    sorted_tup = sorted(tup, key=lambda n: n[1], reverse=True)
    sorted_colors = [c for c, p in sorted_tup]
    sorted_percents = [p for c, p in sorted_tup]

    plt.pie(sorted_percents, colors=sorted_colors, counterclock=False, startangle=90)
    pie_chart_filename = f'pie_chart_{uuid.uuid4().hex}.png'
    pie_chart_path = os.path.join(UPLOAD_FOLDER, pie_chart_filename)
    plt.savefig(pie_chart_path)
    print(f"Saved pie chart at: {pie_chart_path}")  # デバッグ出力
    plt.clf()

    return emotions, pie_chart_filename
